# SQL with Python Tutorial
## link: https://www.youtube.com/watch?v=zrNHkRgWzTI

In [1]:
# import libraries

import mysql.connector
from mysql.connector import Error
import pandas as pd

In [2]:
def create_server_connection(host_name, user_name, user_password):
    connection = None
    try:
        connection = mysql.connector.connect(
            host = host_name,
            user = user_name,
            passwd = user_password
        )
        print('MySQL Database connection successful.')
    except Error as err:
        print(f"Error:'{err}'")
    return connection

# Put our MySQL Terminal password

pw = 'Niyuanmike1'

# Database name
db = 'Nep_SQL_python'
connection = create_server_connection('localhost', 'root', pw)

MySQL Database connection successful.

In [4]:
# Create Database 'Nep_SQL_python'

def create_database(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        print('Database create successfully.')
    except Error as err:
        print(f"Error: '{err}'")

create_database_query = 'Create database Nep_SQL_python'
create_database(connection, create_database_query)

Error: '1007 (HY000): Can't create database 'nep_sql_python'; database exists'

In [3]:
# function for Connect to Database

def create_db_connection(host_name, user_name, user_password, db_name):
    connection = None
    try:
        connection = mysql.connector.connect(
            host = host_name,
            user = user_name,
            passwd = user_password,
            database = db_name
        )
        print('MySQL database connection successfull')
    except Error as err:
        print(f"Error: '{err}'")
    return connection

In [4]:
# function for Execute SQL queries

def execute_query(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print('Query was executed successfully')
    except Error as err:
        print(f"Error: '{err}'")

In [14]:
# create table in database

create_orders_table = '''
create table orders(
order_id INT PRIMARY KEY,
customer_name VARCHAR(30) NOT NULL,
product_name VARCHAR(20) NOT NULL,
date_ordered DATE,
quantity INT,
unit_price FLOAT,
phone_number VARCHAR(20));
'''

# connect to the database
connection = create_db_connection('localhost', 'root', pw, db)
execute_query(connection, create_orders_table)

MySQL database connection successfull
Error: '1050 (42S01): Table 'orders' already exists'

In [7]:
# Insert data

data_orders = '''
INSERT INTO orders VALUES 
(101, 'Steve', 'Labptop', '2021-11-17', 2, 800, '6238728802'),
(102, 'John', 'Books', '2021-11-18', 5, 40, '345345345'),
(103, 'Mike', 'Trousers', '2021-10-15', 6, 25, '672527965852'),
(104, 'Danny', 'T-shirt', '2020-11-16', 7, 15, '25385454'),
(105, 'Nancy', 'Mobile Phone', '2021-09-13', 13, 400, '49698574');
'''
connection = create_db_connection('localhost', 'root', pw, db)
execute_query(connection, data_orders)

MySQL database connection successfull
Query was executed successfully

In [8]:
# read query

def read_query(connection, query):
    cursor = connection.cursor()
    result = None
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        return result
    except Error as err:
        print(f"Error: '{err}'")

In [9]:
# Using the SELECT statement

q1 = '''
SELECT * FROM orders;
'''

connection = create_db_connection('localhost', 'root', pw, db)
results = read_query(connection, q1)
for result in results:
    print(result)

MySQL database connection successfull
(101, 'Steve', 'Labptop', datetime.date(2021, 11, 17), 2, 800.0, '6238728802')
(102, 'John', 'Books', datetime.date(2021, 11, 18), 5, 40.0, '345345345')
(103, 'Mike', 'Trousers', datetime.date(2021, 10, 15), 6, 25.0, '672527965852')
(104, 'Danny', 'T-shirt', datetime.date(2020, 11, 16), 7, 15.0, '25385454')
(105, 'Nancy', 'Mobile Phone', datetime.date(2021, 9, 13), 13, 400.0, '49698574')

In [10]:
q2 = '''
SELECT customer_name, phone_number FROM orders;
'''

connection = create_db_connection('localhost', 'root', pw, db)
results = read_query(connection, q2)
for result in results:
    print(result)

MySQL database connection successfull
('Steve', '6238728802')
('John', '345345345')
('Mike', '672527965852')
('Danny', '25385454')
('Nancy', '49698574')

In [12]:
results

[('Steve', '6238728802'),
 ('John', '345345345'),
 ('Mike', '672527965852'),
 ('Danny', '25385454'),
 ('Nancy', '49698574')]

In [17]:
# how to rename columns
q3 = '''
ALTER TABLE orders RENAME COLUMN data_ordered TO date_ordered;
'''

connection = create_db_connection('localhost', 'root', pw, db)
results = read_query(connection, q3)

MySQL database connection successfull
Error: '1054 (42S22): Unknown column 'data_ordered' in 'orders''

In [19]:
q4 = '''
SELECT year(date_ordered) FROM orders;
'''

connection = create_db_connection('localhost', 'root', pw, db)
results = read_query(connection, q4)
for result in results:
    print(result)

MySQL database connection successfull
(2021,)
(2021,)
(2021,)
(2020,)
(2021,)

In [20]:
# use distinct to select non-repetitive values
q5 = '''
SELECT distinct year(date_ordered) FROM orders;
'''

connection = create_db_connection('localhost', 'root', pw, db)
results = read_query(connection, q5)
for result in results:
    print(result)

MySQL database connection successfull
(2021,)
(2020,)

In [21]:
q6 = '''
SELECT * FROM orders WHERE date_ordered < '2021-10-01';
'''

connection = create_db_connection('localhost', 'root', pw, db)
results = read_query(connection, q6)
for result in results:
    print(result)

MySQL database connection successfull
(104, 'Danny', 'T-shirt', datetime.date(2020, 11, 16), 7, 15.0, '25385454')
(105, 'Nancy', 'Mobile Phone', datetime.date(2021, 9, 13), 13, 400.0, '49698574')

In [23]:
q7 = '''
SELECT * FROM orders ORDER BY unit_price DESC;
'''

connection = create_db_connection('localhost', 'root', pw, db)
results = read_query(connection, q7)
for result in results:
    print(result)

MySQL database connection successfull
(101, 'Steve', 'Labptop', datetime.date(2021, 11, 17), 2, 800.0, '6238728802')
(105, 'Nancy', 'Mobile Phone', datetime.date(2021, 9, 13), 13, 400.0, '49698574')
(102, 'John', 'Books', datetime.date(2021, 11, 18), 5, 40.0, '345345345')
(103, 'Mike', 'Trousers', datetime.date(2021, 10, 15), 6, 25.0, '672527965852')
(104, 'Danny', 'T-shirt', datetime.date(2020, 11, 16), 7, 15.0, '25385454')

In [27]:
# how to display table using pandas

from_db = []

for result in results:
    result = list(result)
    from_db.append(result)

columns = ['order_id',
'customer_name',
'product_name',
'date_ordered',
'quantity',
'unit_price',
'phone_number']

df = pd.DataFrame(from_db, columns = columns)

display(df)

,order_id,customer_name,product_name,date_ordered,quantity,unit_price,phone_number
0,101,Steve,Labptop,2021-11-17,2,800.0,6238728802
1,105,Nancy,Mobile Phone,2021-09-13,13,400.0,49698574
2,102,John,Books,2021-11-18,5,40.0,345345345
3,103,Mike,Trousers,2021-10-15,6,25.0,672527965852
4,104,Danny,T-shirt,2020-11-16,7,15.0,25385454

In [29]:
# Update command

update = '''
UPDATE orders
SET unit_price = 45
WHERE order_id = 103
'''

connection = create_db_connection('localhost', 'root', pw, db)
execute_query(connection, update)

MySQL database connection successfull
Query was executed successfully

In [30]:
# check 

q8 = '''
SELECT * FROM orders 
WHERE order_id = 103;
'''

connection = create_db_connection('localhost', 'root', pw, db)
results = read_query(connection, q8)
for result in results:
    print(result)

MySQL database connection successfull
(103, 'Mike', 'Trousers', datetime.date(2021, 10, 15), 6, 45.0, '672527965852')

In [31]:
# Delete command

delete_order = '''
DELETE FROM orders
WHERE order_id = 105
'''

connection = create_db_connection('localhost', 'root', pw, db)
execute_query(connection, delete_order)

MySQL database connection successfull
Query was executed successfully

In [32]:
#check 

q9 = '''
SELECT * FROM orders
'''

connection = create_db_connection('localhost', 'root', pw, db)
results = read_query(connection, q9)
for result in results:
    print(result)

MySQL database connection successfull
(101, 'Steve', 'Labptop', datetime.date(2021, 11, 17), 2, 800.0, '6238728802')
(102, 'John', 'Books', datetime.date(2021, 11, 18), 5, 40.0, '345345345')
(103, 'Mike', 'Trousers', datetime.date(2021, 10, 15), 6, 45.0, '672527965852')
(104, 'Danny', 'T-shirt', datetime.date(2020, 11, 16), 7, 15.0, '25385454')